wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_adc.h
/*!
    \file    gd32f50x_adc.h
    \brief   definitions for the ADC

    \version 2025-11-10, V1.01, firmware for GD32F50x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32F50X_ADC_H
#define GD32F50X_ADC_H

#include "gd32f50x.h"

/* ADC definitions */
#define ADC0                     ADC_BASE                         /*!< ADC0 base address */
#define ADC1                     (ADC_BASE + 0x00000400U)         /*!< ADC1 base address */
#define ADC2                     (ADC_BASE + 0x00001800U)         /*!< ADC2 base address */

/* registers definitions */
#define ADC_STAT(adcx)           REG32((adcx) + 0x00000000U)       /*!< ADC status register */
#define ADC_CTL0(adcx)           REG32((adcx) + 0x00000004U)       /*!< ADC control register 0 */
#define ADC_CTL1(adcx)           REG32((adcx) + 0x00000008U)       /*!< ADC control register 1 */
#define ADC_SAMPT0(adcx)         REG32((adcx) + 0x0000000CU)       /*!< ADC sample time register 0 */
#define ADC_SAMPT1(adcx)         REG32((adcx) + 0x00000010U)       /*!< ADC sample time register 1 */
#define ADC_IOFF0(adcx)          REG32((adcx) + 0x00000014U)       /*!< ADC inserted channel data offset register 0 */
#define ADC_IOFF1(adcx)          REG32((adcx) + 0x00000018U)       /*!< ADC inserted channel data offset register 1 */
#define ADC_IOFF2(adcx)          REG32((adcx) + 0x0000001CU)       /*!< ADC inserted channel data offset register 2 */
#define ADC_IOFF3(adcx)          REG32((adcx) + 0x00000020U)       /*!< ADC inserted channel data offset register 3 */
#define ADC_WD0HT(adcx)          REG32((adcx) + 0x00000024U)       /*!< ADC watchdog 0 high threshold register */
#define ADC_WD0LT(adcx)          REG32((adcx) + 0x00000028U)       /*!< ADC watchdog 0 low threshold register */
#define ADC_RSQ0(adcx)           REG32((adcx) + 0x0000002CU)       /*!< ADC routine sequence register 0 */
#define ADC_RSQ1(adcx)           REG32((adcx) + 0x00000030U)       /*!< ADC routine sequence register 1 */
#define ADC_RSQ2(adcx)           REG32((adcx) + 0x00000034U)       /*!< ADC routine sequence register 2 */
#define ADC_ISQ(adcx)            REG32((adcx) + 0x00000038U)       /*!< ADC inserted sequence register */
#define ADC_LDATA0(adcx)         REG32((adcx) + 0x0000003CU)       /*!< ADC latch data register 0 */
#define ADC_LDATA1(adcx)         REG32((adcx) + 0x00000040U)       /*!< ADC latch data register 1 */
#define ADC_LDATA2(adcx)         REG32((adcx) + 0x00000044U)       /*!< ADC latch data register 2 */
#define ADC_LDATA3(adcx)         REG32((adcx) + 0x00000048U)       /*!< ADC latch data register 3 */
#define ADC_RDATA(adcx)          REG32((adcx) + 0x0000004CU)       /*!< ADC routine data register */
#define ADC_IDATA(adcx)          REG32((adcx) + 0x00000050U)       /*!< ADC inserted data register */
#define ADC_LDCTL(adcx)          REG32((adcx) + 0x00000054U)       /*!< ADC latch data control register */
#define ADC_OVSAMPCTL(adcx)      REG32((adcx) + 0x00000080U)       /*!< ADC oversample control register */

/* bits definitions */
/* ADC_STAT */
#define ADC_STAT_WD0E            BIT(0)                            /*!< analog watchdog 0 event flag */
#define ADC_STAT_EORC            BIT(1)                            /*!< end flag of routine sequence conversion */
#define ADC_STAT_EOIC            BIT(2)                            /*!< end flag of inserted sequence conversion */
#define ADC_STAT_STIC            BIT(3)                            /*!< start flag of inserted sequence */
#define ADC_STAT_STRC            BIT(4)                            /*!< start flag of routine sequence */

/* ADC_CTL0 */
#define ADC_CTL0_WD0CHSEL        BITS(0,4)                         /*!< analog watchdog 0 channel select */
#define ADC_CTL0_EORCIE          BIT(5)                            /*!< interrupt enable for EORC */
#define ADC_CTL0_WD0EIE          BIT(6)                            /*!< interrupt enable for WD0E */
#define ADC_CTL0_EOICIE          BIT(7)                            /*!< interrupt enable for EOIC */
#define ADC_CTL0_SM              BIT(8)                            /*!< scan mode */
#define ADC_CTL0_WD0SC           BIT(9)                            /*!< when in scan mode, analog watchdog 0 is effective on a single channel */
#define ADC_CTL0_ICA             BIT(10)                           /*!< inserted sequence convert automatically */
#define ADC_CTL0_DISRC           BIT(11)                           /*!< discontinuous mode on routine sequence */
#define ADC_CTL0_DISIC           BIT(12)                           /*!< discontinuous mode on inserted sequence */
#define ADC_CTL0_DISNUM          BITS(13,15)                       /*!< number of conversions in discontinuous mode */
#define ADC_CTL0_SYNCM           BITS(16,19)                       /*!< sync mode selection */
#define ADC_CTL0_IWD0EN          BIT(22)                           /*!< inserted sequence analog watchdog 0 enable */
#define ADC_CTL0_RWD0EN          BIT(23)                           /*!< routine sequence analog watchdog 0 enable */

/* ADC_CTL1 */
#define ADC_CTL1_ADCON           BIT(0)                            /*!< ADC ON */
#define ADC_CTL1_CTN             BIT(1)                            /*!< continuous mode */
#define ADC_CTL1_IDMA            BIT(7)                            /*!< DMA request enable for inserted channel */
#define ADC_CTL1_RDMA            BIT(8)                            /*!< DMA request enable for routine channel */
#define ADC_CTL1_DAL             BIT(11)                           /*!< data alignment */
#define ADC_CTL1_ETMIC           BITS(13,14)                       /*!< external trigger mode for inserted channel */
#define ADC_CTL1_ETMRC           BITS(18,19)                       /*!< external trigger mode for routine channel */
#define ADC_CTL1_SWICST          BIT(21)                           /*!< software start on inserted channel */
#define ADC_CTL1_SWRCST          BIT(22)                           /*!< software start on routine channel */
#define ADC_CTL1_INREFEN         BIT(23)                           /*!< channel 17 (internal reference voltage VREFINT) enable of ADC0 */
#define ADC_CTL1_TSVEN           BIT(24)                           /*!< channel 16 (temperature sensor) enable of ADC0 */

/* ADC_SAMPTx x=0..1 */
#define ADC_SAMPTX_SPTN          BITS(0,2)                         /*!< channel x sample time selection */

