wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_adc.h
/* ADC_IOFFx (x=0..3) */
#define ADC_IOFFX_IOFF           BITS(0,11)                        /*!< data offset for inserted channel x */

/* ADC_WD0HT */
#define ADC_WD0HT_WD0HT          BITS(0,19)                        /*!< high threshold for analog watchdog 0 */

/* ADC_WD0LT */
#define ADC_WD0LT_WD0LT          BITS(0,19)                        /*!< low threshold for analog watchdog 0 */

/* ADC_RSQx */
#define ADC_RSQX_RSQN            BITS(0,4)                         /*!< x conversion in routine sequence */
#define ADC_RSQ0_RL              BITS(20,23)                       /*!< routine sequence length */

/* ADC_ISQ */
#define ADC_ISQ_ISQN             BITS(0,4)                         /*!< x conversion in inserted sequence */
#define ADC_ISQ_IL               BITS(20,21)                       /*!< inserted sequence length */

/* ADC_LDATAx (x=0..3) */
#define ADC_LDATAX_LDATAN        BITS(0,15)                        /*!< inserted or routine number x conversion data */

/* ADC_RDATA */
#define ADC_RDATA_RDATA          BITS(0,15)                        /*!< routine channel data */
#define ADC_RDATA_ADC1RDATA      BITS(16,31)                       /*!< ADC1 routine channel data */

/* ADC_IDATA */
#define ADC_IDATA_IDATA          BITS(0,15)                        /*!< inserted channel data */

/* ADC_LDCTL */
#define ADC_LDCTL_COVSELx        BITS(0,3)                         /*!< the ADC_LDATAx register conversion source selection */
#define ADC_LDCTL_SEQSELx        BIT(7)                            /*!< the ADC_LDATAx register sequence source selection */

/* ADC_OVSAMPCTL */
#define ADC_OVSAMPCTL_OVSEN      BIT(0)                            /*!< oversampler enable */
#define ADC_OVSAMPCTL_OVSR       BITS(2,4)                         /*!< oversampling ratio */
#define ADC_OVSAMPCTL_OVSS       BITS(5,8)                         /*!< oversampling shift */
#define ADC_OVSAMPCTL_TOVS       BIT(9)                            /*!< triggered oversampling */
#define ADC_OVSAMPCTL_DRES       BITS(12,13)                       /*!< ADC resolution */

/* constants definitions */
/* ADC flag definitions */
#define ADC_FLAG_WD0E                                        ADC_STAT_WD0E                     /*!< analog watchdog 0 event flag */
#define ADC_FLAG_EORC                                        ADC_STAT_EORC                     /*!< end of routine sequence conversion flag */
#define ADC_FLAG_EOIC                                        ADC_STAT_EOIC                     /*!< end of inserted sequence conversion flag */
#define ADC_FLAG_STIC                                        ADC_STAT_STIC                     /*!< start of inserted sequence conversion flag */
#define ADC_FLAG_STRC                                        ADC_STAT_STRC                     /*!< start of routine sequence conversion flag */

/* ADC interrupt definitions*/
#define ADC_INT_WD0E                                         ADC_CTL0_WD0EIE                   /*!< analog watchdog 0 event interrupt */
#define ADC_INT_EORC                                         ADC_CTL0_EORCIE                   /*!< end of routine sequence conversion interrupt */
#define ADC_INT_EOIC                                         ADC_CTL0_EOICIE                   /*!< end of inserted sequence conversion interrupt */

/* ADC interrupt flag definitions*/
#define ADC_INT_FLAG_WD0E                                    ADC_STAT_WD0E                     /*!< analog watchdog 0 event interrupt flag */
#define ADC_INT_FLAG_EORC                                    ADC_STAT_EORC                     /*!< end of routine sequence conversion interrupt flag */
#define ADC_INT_FLAG_EOIC                                    ADC_STAT_EOIC                     /*!< end of inserted sequence conversion interrupt flag */

/* ADC special function definitions */
#define ADC_SCAN_MODE                                        ADC_CTL0_SM                       /*!< scan mode */
#define ADC_INSERTED_CHANNEL_AUTO                            ADC_CTL0_ICA                      /*!< inserted channel sequence convert automatically */
#define ADC_CONTINUOUS_MODE                                  ADC_CTL1_CTN                      /*!< continuous mode */

/* number of conversions in discontinuous mode*/
#define CTL0_DISNUM(regval)                                  (BITS(13,15) & ((uint32_t)(regval) << 13))

/* ADC synchronization mode selection */
#define CTL0_SYNCM(regval)                                   (BITS(16,19) & ((uint32_t)(regval) << 16))
#define ADC_MODE_FREE                                        CTL0_SYNCM(0)                     /*!< free mode */
#define ADC_DAUL_ROUTINE_PARALLEL_INSERTED_PARALLEL          CTL0_SYNCM(1)                     /*!< combined routine parallel + inserted parallel mode */
#define ADC_DAUL_ROUTINE_PARALLEL_INSERTED_ROTATION          CTL0_SYNCM(2)                     /*!< combined routine parallel + inserted trigger rotation mode */
#define ADC_DAUL_INSERTED_PARALLEL_ROUTINE_FOLLOWUP_FAST     CTL0_SYNCM(3)                     /*!< combined inserted parallel + routine follow-up fast mode */
#define ADC_DAUL_INSERTED_PARALLEL_ROUTINE_FOLLOWUP_SLOW     CTL0_SYNCM(4)                     /*!< combined inserted parallel + routine follow-up slow mode */
#define ADC_DAUL_INSERTED_PARALLEL                           CTL0_SYNCM(5)                     /*!< inserted parallel mode */
#define ADC_DAUL_ROUTINE_PARALLEL                            CTL0_SYNCM(6)                     /*!< routine parallel mode */
#define ADC_DAUL_ROUTINE_FOLLOWUP_FAST                       CTL0_SYNCM(7)                     /*!< routine follow-up fast mode */
#define ADC_DAUL_ROUTINE_FOLLOWUP_SLOW                       CTL0_SYNCM(8)                     /*!< routine follow-up slow mode */
#define ADC_DAUL_INSERTED_TRIGGER_ROTATION                   CTL0_SYNCM(9)                     /*!< inserted trigger rotation mode */

/* ADC data alignment */
#define ADC_DATAALIGN_RIGHT                                  ((uint32_t)0x00000000U)           /*!< LSB alignment */
#define ADC_DATAALIGN_LEFT                                   ADC_CTL1_DAL                      /*!< MSB alignment */

/* temperature sensor channel, internal reference voltage channel */
#define ADC_CHANNEL_INTERNAL_TEMPSENSOR                      ADC_CTL1_TSVEN                    /*!< temperature channel */
#define ADC_CHANNEL_INTERNAL_VREFINT                         ADC_CTL1_INREFEN                  /*!< internal vrefint channel */

/* external trigger mode for routine and inserted  channel */
#define EXTERNAL_TRIGGER_DISABLE                             ((uint32_t)0x00000003U)           /*!< external trigger disable */
#define EXTERNAL_TRIGGER_RISING                              ((uint32_t)0x00000001U)           /*!< rising edge of external trigger */

