wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_adc.h
/* sample time */
#define SAMPTX_SPT(regval)                                   (BITS(0,2) & ((uint32_t)(regval) << 0))
#define ADC_SAMPLETIME_1POINT5                               SAMPTX_SPT(0)                     /*!< 1.5 sampling cycles */
#define ADC_SAMPLETIME_7POINT5                               SAMPTX_SPT(1)                     /*!< 7.5 sampling cycles */
#define ADC_SAMPLETIME_13POINT5                              SAMPTX_SPT(2)                     /*!< 13.5 sampling cycles */
#define ADC_SAMPLETIME_28POINT5                              SAMPTX_SPT(3)                     /*!< 28.5 sampling cycles */
#define ADC_SAMPLETIME_41POINT5                              SAMPTX_SPT(4)                     /*!< 41.5 sampling cycles */
#define ADC_SAMPLETIME_55POINT5                              SAMPTX_SPT(5)                     /*!< 55.5 sampling cycles */
#define ADC_SAMPLETIME_71POINT5                              SAMPTX_SPT(6)                     /*!< 71.5 sampling cycles */
#define ADC_SAMPLETIME_239POINT5                             SAMPTX_SPT(7)                     /*!< 239.5 sampling cycles */

/* ADC_IOFFx register value */
#define IOFFX_IOFF(regval)                                   (BITS(0,11) & ((uint32_t)(regval) << 0))

/* ADC_WD0HT register value */
#define WD0HT_WD0HT(regval)                                  (BITS(0,19) & ((uint32_t)(regval) << 0))

/* ADC_WD0LT register value */
#define WD0LT_WD0LT(regval)                                  (BITS(0,19) & ((uint32_t)(regval) << 0))

/* ADC_ISQ0 register value */
#define RSQ0_RL(regval)                                      (BITS(20,23) & ((uint32_t)(regval) << 20))

/* ADC_ISQ register value */
#define ISQ_IL(regval)                                       (BITS(20,21) & ((uint32_t)(regval) << 20))

/* ADC latch data definitions */
#define ADC_LATCH_DATA_0                                     ((uint8_t)0x00U)                  /*!< ADC latch data 0 */
#define ADC_LATCH_DATA_1                                     ((uint8_t)0x01U)                  /*!< ADC latch data 1 */
#define ADC_LATCH_DATA_2                                     ((uint8_t)0x02U)                  /*!< ADC latch data 2 */
#define ADC_LATCH_DATA_3                                     ((uint8_t)0x03U)                  /*!< ADC latch data 3 */

/* ADC resolution */
#define OVSAMPCTL_DRES(regval)                               (BITS(12,13) & ((uint32_t)(regval) << 12))
#define ADC_RESOLUTION_12B                                   OVSAMPCTL_DRES(0)                 /*!< 12-bit ADC resolution */
#define ADC_RESOLUTION_10B                                   OVSAMPCTL_DRES(1)                 /*!< 10-bit ADC resolution */
#define ADC_RESOLUTION_8B                                    OVSAMPCTL_DRES(2)                 /*!< 8-bit ADC resolution */
#define ADC_RESOLUTION_6B                                    OVSAMPCTL_DRES(3)                 /*!< 6-bit ADC resolution */

/* oversampling shift */
#define OVSAMPCTL_OVSS(regval)                               (BITS(5,8) & ((uint32_t)(regval) << 5))
#define ADC_OVERSAMPLING_SHIFT_NONE                          OVSAMPCTL_OVSS(0)                 /*!< no oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_1B                            OVSAMPCTL_OVSS(1)                 /*!< 1-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_2B                            OVSAMPCTL_OVSS(2)                 /*!< 2-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_3B                            OVSAMPCTL_OVSS(3)                 /*!< 3-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_4B                            OVSAMPCTL_OVSS(4)                 /*!< 4-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_5B                            OVSAMPCTL_OVSS(5)                 /*!< 5-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_6B                            OVSAMPCTL_OVSS(6)                 /*!< 6-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_7B                            OVSAMPCTL_OVSS(7)                 /*!< 7-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_8B                            OVSAMPCTL_OVSS(8)                 /*!< 8-bit oversampling shift */

/* oversampling ratio */
#define OVSAMPCTL_OVSR(regval)                               (BITS(2,4) & ((uint32_t)(regval) << 2))
#define ADC_OVERSAMPLING_RATIO_MUL2                          OVSAMPCTL_OVSR(0)                 /*!< oversampling ratio 2X */
#define ADC_OVERSAMPLING_RATIO_MUL4                          OVSAMPCTL_OVSR(1)                 /*!< oversampling ratio 4X */
#define ADC_OVERSAMPLING_RATIO_MUL8                          OVSAMPCTL_OVSR(2)                 /*!< oversampling ratio 8X */
#define ADC_OVERSAMPLING_RATIO_MUL16                         OVSAMPCTL_OVSR(3)                 /*!< oversampling ratio 16X */
#define ADC_OVERSAMPLING_RATIO_MUL32                         OVSAMPCTL_OVSR(4)                 /*!< oversampling ratio 32X */
#define ADC_OVERSAMPLING_RATIO_MUL64                         OVSAMPCTL_OVSR(5)                 /*!< oversampling ratio 64X */
#define ADC_OVERSAMPLING_RATIO_MUL128                        OVSAMPCTL_OVSR(6)                 /*!< oversampling ratio 128X */
#define ADC_OVERSAMPLING_RATIO_MUL256                        OVSAMPCTL_OVSR(7)                 /*!< oversampling ratio 256X */

/* triggered oversampling */
#define ADC_OVERSAMPLING_ALL_CONVERT                         ((uint32_t)0x00000000U)           /*!< all oversampled conversions for a channel are done consecutively after a trigger */
#define ADC_OVERSAMPLING_ONE_CONVERT                         ADC_OVSAMPCTL_TOVS                /*!< each oversampled conversion for a channel needs a trigger */

/* ADC channel sequence definitions */
#define ADC_ROUTINE_CHANNEL                                  ((uint8_t)0x01U)                  /*!< adc routine channel sequence */
#define ADC_INSERTED_CHANNEL                                 ((uint8_t)0x02U)                  /*!< adc inserted channel sequence */
#define ADC_ROUTINE_INSERTED_CHANNEL                         ((uint8_t)0x03U)                  /*!< both routine and inserted channel sequence */
#define ADC_CHANNEL_DISCON_DISABLE                           ((uint8_t)0x04U)                  /*!< disable discontinuous mode of routine & inserted channel */

