wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_adc.h
/* ADC inserted channel definitions */
#define ADC_INSERTED_CHANNEL_0                               ((uint8_t)0x00U)                  /*!< ADC inserted channel 0 */
#define ADC_INSERTED_CHANNEL_1                               ((uint8_t)0x01U)                  /*!< ADC inserted channel 1 */
#define ADC_INSERTED_CHANNEL_2                               ((uint8_t)0x02U)                  /*!< ADC inserted channel 2 */
#define ADC_INSERTED_CHANNEL_3                               ((uint8_t)0x03U)                  /*!< ADC inserted channel 3 */

/* ADC channel definitions */
#define ADC_CHANNEL_0                                        ((uint8_t)0x00U)                  /*!< ADC channel 0 */
#define ADC_CHANNEL_1                                        ((uint8_t)0x01U)                  /*!< ADC channel 1 */
#define ADC_CHANNEL_2                                        ((uint8_t)0x02U)                  /*!< ADC channel 2 */
#define ADC_CHANNEL_3                                        ((uint8_t)0x03U)                  /*!< ADC channel 3 */
#define ADC_CHANNEL_4                                        ((uint8_t)0x04U)                  /*!< ADC channel 4 */
#define ADC_CHANNEL_5                                        ((uint8_t)0x05U)                  /*!< ADC channel 5 */
#define ADC_CHANNEL_6                                        ((uint8_t)0x06U)                  /*!< ADC channel 6 */
#define ADC_CHANNEL_7                                        ((uint8_t)0x07U)                  /*!< ADC channel 7 */
#define ADC_CHANNEL_8                                        ((uint8_t)0x08U)                  /*!< ADC channel 8 */
#define ADC_CHANNEL_9                                        ((uint8_t)0x09U)                  /*!< ADC channel 9 */
#define ADC_CHANNEL_10                                       ((uint8_t)0x0AU)                  /*!< ADC channel 10 */
#define ADC_CHANNEL_11                                       ((uint8_t)0x0BU)                  /*!< ADC channel 11 */
#define ADC_CHANNEL_12                                       ((uint8_t)0x0CU)                  /*!< ADC channel 12 */
#define ADC_CHANNEL_13                                       ((uint8_t)0x0DU)                  /*!< ADC channel 13 */
#define ADC_CHANNEL_14                                       ((uint8_t)0x0EU)                  /*!< ADC channel 14 */
#define ADC_CHANNEL_15                                       ((uint8_t)0x0FU)                  /*!< ADC channel 15 */
#define ADC_CHANNEL_16                                       ((uint8_t)0x10U)                  /*!< ADC channel 16 */
#define ADC_CHANNEL_17                                       ((uint8_t)0x11U)                  /*!< ADC channel 17 */

/* function declarations */
/* ADC deinitialization and initialization functions */
/* reset ADC */
void adc_deinit(uint32_t adc_periph);
/* enable ADC interface */
void adc_enable(uint32_t adc_periph);
/* disable ADC interface */
void adc_disable(uint32_t adc_periph);

/* ADC DMA functions */
/* enable DMA request*/
void adc_dma_mode_enable(uint32_t adc_periph, uint8_t adc_sequence);
/* disable DMA request*/
void adc_dma_mode_disable(uint32_t adc_periph, uint8_t adc_sequence);

/* ADC special function functions */
/* configure ADC discontinuous mode */
void adc_discontinuous_mode_config(uint32_t adc_periph , uint8_t adc_sequence, uint8_t length);
/* configure ADC special function */
void adc_special_function_config(uint32_t adc_periph , uint32_t function, ControlStatus newvalue);
/* enable or disable ADC internal channels */
void adc_internal_channel_config(uint32_t internal_channel, ControlStatus newvalue);

/* ADC synchronization */
/* configure the ADC sync mode */
void adc_sync_mode_config(uint32_t sync_mode);
/* read ADC0 and ADC1 routine sequence data in sync mode */
uint32_t adc_sync_routine_data_read(void);

/* ADC channel configuration functions */
/* configure ADC data alignment */
void adc_data_alignment_config(uint32_t adc_periph , uint32_t data_alignment);
/* configure the channel length of routine sequence or inserted sequence */
void adc_channel_length_config(uint32_t adc_periph , uint8_t adc_sequence, uint32_t length);
/* configure ADC routine channel */
void adc_routine_channel_config(uint32_t adc_periph , uint8_t rank, uint8_t adc_channel, uint32_t sample_time);
/* configure ADC inserted channel */
void adc_inserted_channel_config(uint32_t adc_periph , uint8_t rank, uint8_t adc_channel, uint32_t sample_time);
/* configure ADC inserted channel offset */
void adc_inserted_channel_offset_config(uint32_t adc_periph , uint8_t inserted_channel, uint16_t offset);
/* enable ADC external trigger */
void adc_external_trigger_config(uint32_t adc_periph, uint8_t adc_sequence, uint32_t trigger_mode);
/* enable ADC software trigger */
void adc_software_trigger_enable(uint32_t adc_periph , uint8_t adc_sequence);

/* ADC data read functions */
/* read ADC routine sequence data register */
uint16_t adc_routine_data_read(uint32_t adc_periph);
/* read ADC inserted sequence data register */
uint16_t adc_inserted_data_read(uint32_t adc_periph);
/* read ADC latch data register */
uint16_t adc_latch_data_read(uint32_t adc_periph, uint8_t latch_data);
/* configure ADC latch data source */
void adc_latch_data_source_config(uint32_t adc_periph, uint8_t latch_data, uint8_t adc_sequence, uint8_t rank);

/* ADC analog watchdog functions */
/* enable ADC analog watchdog 0 single channel */
void adc_watchdog0_single_channel_enable(uint32_t adc_periph, uint8_t adc_channel);
/* enable ADC analog watchdog 0 sequence channel */
void adc_watchdog0_sequence_channel_enable(uint32_t adc_periph, uint8_t adc_sequence);
/* disable ADC analog watchdog 0 */
void adc_watchdog0_disable(uint32_t adc_periph);
/* configure ADC analog watchdog 0 threshold */
void adc_watchdog0_threshold_config(uint32_t adc_periph, uint32_t low_threshold, uint32_t high_threshold);

/* ADC resolution and oversample functions */
/* configure ADC resolution */
void adc_resolution_config(uint32_t adc_periph , uint32_t resolution);
/* configure ADC oversample mode */
void adc_oversample_mode_config(uint32_t adc_periph , uint32_t mode , uint16_t shift , uint8_t ratio);
/* enable ADC oversample mode */
void adc_oversample_mode_enable(uint32_t adc_periph);
/* disable ADC oversample mode */
void adc_oversample_mode_disable(uint32_t adc_periph);

/* flag and interrupt functions */
/* get the ADC flag */
FlagStatus adc_flag_get(uint32_t adc_periph, uint32_t flag);
/* clear the ADC flag */
void adc_flag_clear(uint32_t adc_periph, uint32_t flag);
/* enable ADC interrupt */
void adc_interrupt_enable(uint32_t adc_periph, uint32_t interrupt);
/* disable ADC interrupt */
void adc_interrupt_disable(uint32_t adc_periph, uint32_t interrupt);
/* get the ADC interrupt */
FlagStatus adc_interrupt_flag_get(uint32_t adc_periph, uint32_t int_flag);
/* clear the ADC flag */
void adc_interrupt_flag_clear(uint32_t adc_periph, uint32_t int_flag);

#endif /* gd32f50x_ADC_H */
